pgfds-metrics/old_logs/benchmark_logs/20250321_115546/benchmark_100_rps.log
Running 5m test @ http://localhost:5000
  4 threads and 100 connections
  Thread calibration: mean lat.: 88.365ms, rate sampling interval: 604ms
  Thread calibration: mean lat.: 90.391ms, rate sampling interval: 590ms
  Thread calibration: mean lat.: 82.093ms, rate sampling interval: 565ms
  Thread calibration: mean lat.: 98.998ms, rate sampling interval: 642ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    90.49ms  123.89ms 636.42ms   81.48%
    Req/Sec    24.52     14.07    44.00     62.18%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   18.14ms
 75.000%  167.68ms
 90.000%  284.42ms
 99.000%  476.16ms
 99.900%  580.61ms
 99.990%  630.27ms
 99.999%  636.93ms
100.000%  636.93ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.793     0.000000            1         1.00
       3.353     0.100000         2899         1.11
       5.263     0.200000         5790         1.25
       7.559     0.300000         8681         1.43
      10.983     0.400000        11575         1.67
      18.143     0.500000        14468         2.00
      25.215     0.550000        15915         2.22
      35.039     0.600000        17364         2.50
      54.879     0.650000        18808         2.86
     125.311     0.700000        20256         3.33
     167.679     0.750000        21703         4.00
     186.239     0.775000        22426         4.44
     203.007     0.800000        23152         5.00
     221.439     0.825000        23872         5.71
     239.871     0.850000        24596         6.67
     260.479     0.875000        25324         8.00
     271.359     0.887500        25684         8.89
     284.415     0.900000        26044        10.00
     299.007     0.912500        26404        11.43
     314.367     0.925000        26768        13.33
     333.055     0.937500        27129        16.00
     343.039     0.943750        27310        17.78
     353.791     0.950000        27494        20.00
     364.543     0.956250        27671        22.86
     379.135     0.962500        27850        26.67
     393.215     0.968750        28033        32.00
     402.175     0.971875        28122        35.56
     411.135     0.975000        28216        40.00
     421.375     0.978125        28303        45.71
     431.615     0.981250        28396        53.33
     444.927     0.984375        28487        64.00
     451.839     0.985938        28531        71.11
     460.031     0.987500        28574        80.00
     468.479     0.989062        28619        91.43
     480.767     0.990625        28665       106.67
     489.215     0.992188        28711       128.00
     495.359     0.992969        28733       142.22
     499.967     0.993750        28755       160.00
     506.367     0.994531        28777       182.86
     513.791     0.995313        28800       213.33
     524.287     0.996094        28822       256.00
     529.407     0.996484        28836       284.44
     534.015     0.996875        28845       320.00
     540.159     0.997266        28856       365.71
     545.791     0.997656        28868       426.67
     555.007     0.998047        28879       512.00
     561.151     0.998242        28885       568.89
     565.759     0.998437        28890       640.00
     570.879     0.998633        28896       731.43
     575.999     0.998828        28902       853.33
     581.631     0.999023        28907      1024.00
     583.679     0.999121        28910      1137.78
     586.239     0.999219        28913      1280.00
     589.823     0.999316        28916      1462.86
     596.991     0.999414        28919      1706.67
     598.015     0.999512        28921      2048.00
     602.623     0.999561        28923      2275.56
     610.303     0.999609        28924      2560.00
     617.983     0.999658        28927      2925.71
     617.983     0.999707        28927      3413.33
     623.103     0.999756        28928      4096.00
     624.127     0.999780        28929      4551.11
     626.175     0.999805        28931      5120.00
     626.175     0.999829        28931      5851.43
     626.175     0.999854        28931      6826.67
     630.271     0.999878        28932      8192.00
     630.271     0.999890        28932      9102.22
     632.831     0.999902        28933     10240.00
     632.831     0.999915        28933     11702.86
     632.831     0.999927        28933     13653.33
     634.879     0.999939        28934     16384.00
     634.879     0.999945        28934     18204.44
     634.879     0.999951        28934     20480.00
     634.879     0.999957        28934     23405.71
     634.879     0.999963        28934     27306.67
     636.927     0.999969        28935     32768.00
     636.927     1.000000        28935          inf
#[Mean    =       90.491, StdDeviation   =      123.886]
#[Max     =      636.416, Total count    =        28935]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30004 requests in 5.00m, 25.24MB read
Requests/sec:    100.01
Transfer/sec:     86.16KB